Ran Plan for 5 projects:

1. dir: `infrastructure/terraform/github` workspace: `default`
1. dir: `infrastructure/terraform/management/budget` workspace: `default`
1. dir: `infrastructure/terraform/staging/billing` workspace: `default`
1. dir: `infrastructure/terraform/staging/browser` workspace: `default`
1. dir: `infrastructure/terraform/staging/dns` workspace: `default`

### 1. dir: `infrastructure/terraform/github` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fgithub%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/github`

---
### 2. dir: `infrastructure/terraform/management/budget` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_budgets_budget.total_monthly will be updated in-place
~ resource "aws_budgets_budget" "total_monthly" {
        account_id        = "712861137634"
        budget_type       = "COST"
        cost_filters      = {}
        id                = "712861137634:budget-total-monthly"
      ~ limit_amount      = "1.0" -> "1"
        limit_unit        = "USD"
        name              = "budget-total-monthly"
        time_period_end   = "2087-06-15_00:00"
        time_period_start = "2020-06-01_00:00"
        time_unit         = "MONTHLY"

        cost_types {
            include_credit             = true
            include_discount           = true
            include_other_subscription = true
            include_recurring          = true
            include_refund             = true
            include_subscription       = true
            include_support            = true
            include_tax                = true
            include_upfront            = true
            use_amortized              = false
            use_blended                = false
        }

        notification {
            comparison_operator        = "GREATER_THAN"
            notification_type          = "FORECASTED"
            subscriber_email_addresses = [
                "ematej.snuderl@gmail.com",
            ]
            subscriber_sns_topic_arns  = []
            threshold                  = 100
            threshold_type             = "PERCENTAGE"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/management/budget`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fmanagement%252Fbudget%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/management/budget`
</details>

---
### 3. dir: `infrastructure/terraform/staging/billing` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.billing.stripe_price.business must be replaced
-/+ resource "stripe_price" "business" {
        active              = true
      - billing_scheme      = "per_unit" -> null # forces replacement
      ~ created             = 1600790181 -> (known after apply)
        currency            = "eur"
      ~ id                  = "price_1HUDqrI1ysvdCIIxVJCgfNbj" -> (known after apply)
      ~ livemode            = false -> (known after apply)
      - metadata            = {} -> null
      ~ price_id            = "price_1HUDqrI1ysvdCIIxVJCgfNbj" -> (known after apply)
        product             = "prod_I4Map9Hd3GGKIC"
        recurring           = {
            "interval" = "month"
        }
      ~ unit_amount         = 0 -> (known after apply)
        unit_amount_decimal = 199.99
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/billing`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fbilling%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/billing`
</details>

---
### 4. dir: `infrastructure/terraform/staging/browser` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/browser`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fbrowser%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/browser`

---
### 5. dir: `infrastructure/terraform/staging/dns` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/dns`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fdns%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/dns`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
